# St7GetGeometryFaceSurface

Returns the surface number for the specified geometry face.

long St7GetGeometryFaceSurface(long uID, long FaceNum, long* SurfaceNum)

Input Parameters

uID

Strand7 model file ID.

Entities – Geometry

FaceNum

Face number.

Output Parameters
SurfaceNum

Surface number.